cosc583/hw2.tex
% Created 2025-09-02 Tue 16:09
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jackson Mowry}
\date{Tue Sep  2 09:12:18 2025}
\title{Hw2}
\hypersetup{
 pdfauthor={Jackson Mowry},
 pdftitle={Hw2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.31)}, 
 pdflang={English}}
\begin{document}

\maketitle
Complete each question described below. When comparing blocks of ciphertext or plaintext, if corresponding blocks differ then mention which specific blocks differ. If they differ by only 1 bit, mention that fact specifically. If they differ by more than 1 bit, simply state the specific blocks that differ completely. If all blocks differ in the full ciphertext, simply state that there is no relationship. Be as precise as you can in your comparisons to illustrate that you understand the various modes.

\begin{enumerate}
\item Suppose two plaintext samples P and Q are encrypted using a block cipher with the same secret key K and the same initialization vector IV (or nonce) for those modes that require it. Suppose each plaintext sample is divided into 100 blocks (including padding). If all the plaintext blocks of P and Q are the same, except for Block 10, in which they differ by 1 bit, compare the corresponding ciphertext for each block cipher mode.
\begin{itemize}
\item ECB
\begin{itemize}
\item Only block 10 would differ, and the entire block differs completely
\end{itemize}
\item CBC
\begin{itemize}
\item All blocks after and including block 10 differ
\end{itemize}
\item CTR
\begin{itemize}
\item Only block 10 would differ, and it would differ by a single bit
\end{itemize}
\item CFB
\begin{itemize}
\item Block 10 would differ by a single bit, then all following blocks would differ entirely
\end{itemize}
\item OFB
\begin{itemize}
\item Block 10 would differ by a single bit, and all remaining blocks would match
\end{itemize}
\end{itemize}
\item Same as \#1, except assume P and Q are encrypted with a different IV (nonce) as recommended by cryptographers.
\begin{itemize}
\item ECB
\begin{itemize}
\item No difference to the answer for \#1 as there is no use of an IV
\end{itemize}
\item CBC
\begin{itemize}
\item Every block differs
\end{itemize}
\item CTR
\begin{itemize}
\item Every block differs
\end{itemize}
\item CFB
\begin{itemize}
\item Every block differs
\end{itemize}
\item OFB
\begin{itemize}
\item Every block differs
\end{itemize}
\end{itemize}
\item Suppose two ciphertext samples P and Q are decrypted using key K and the same IV (or nonce) when required. Suppose each ciphertext sample of 100 blocks differs by 1 bit in Block 25 only. Compare the corresponding plaintext blocks following decryption of P and Q for each block cipher mode.
\begin{itemize}
\item ECB
\begin{itemize}
\item The entirety of plaintext block 25 would differ, with all other blocks matching exactly
\end{itemize}
\item CBC
\begin{itemize}
\item The block 25 would differ by a bit
\end{itemize}
\item CTR
\begin{itemize}
\item The block 25 would differ by a bit
\end{itemize}
\item CFB
\begin{itemize}
\item The block 25 would differ by a bit, and all following blocks would be entirely different
\end{itemize}
\item OFB
\begin{itemize}
\item The block 25 would differ by a bit
\end{itemize}
\end{itemize}
\item Assume each ciphertext block is stored on a separate disk block that can be accessed independently. Suppose only Block 50 of an encrypted file of 100 blocks needs to be accessed. Which specific blocks of ciphertext must be accessed to obtain the plaintext for Block 50 for the following modes?
\begin{itemize}
\item ECB
\begin{itemize}
\item 50
\end{itemize}
\item CBC
\begin{itemize}
\item 1-50
\end{itemize}
\item CTR
\begin{itemize}
\item 50
\end{itemize}
\item CFB
\begin{itemize}
\item 1-50
\end{itemize}
\item OFB
\begin{itemize}
\item 50
\end{itemize}
\end{itemize}
\item Specify which of the following each mode allows: parallel encryption, parallel decryption, pre-computation of the key stream.
\begin{itemize}
\item ECB
\begin{itemize}
\item Parallel both, no need for pre-computation
\end{itemize}
\item CBC
\begin{itemize}
\item Encryption serial, decryption parallel, cannot pre-compute
\end{itemize}
\item CTR
\begin{itemize}
\item Parallel both, can pre-compute the key stream
\end{itemize}
\item CFB
\begin{itemize}
\item Encryption serial, decryption parallel, cannot pre-compute
\end{itemize}
\item OFB
\begin{itemize}
\item Both serial, can pre-compute the key stream
\end{itemize}
\end{itemize}
\end{enumerate}
\end{document}
